In [1]:
import pandas as pd

### Movie

In [4]:
movie_cols = ['movie_id', 'title']
movies = pd.read_table('data/u.item', sep='|', header=None, names=movie_cols, usecols=[0,1])
movies.head()

   movie_id              title
0         1   Toy Story (1995)
1         2   GoldenEye (1995)
2         3  Four Rooms (1995)
3         4  Get Shorty (1995)
4         5     Copycat (1995)

In [5]:
movies.shape

(1682, 2)

In [7]:
movies.movie_id.unique()

array([   1,    2,    3, ..., 1680, 1681, 1682], dtype=int64)

### Ratings

In [8]:
rating_cols = ['user_id', 'movie_id','rating','timestamp']

In [9]:
ratings = pd.read_table('data/u.data', sep='\t', header=None, names=rating_cols)
ratings.head()

   user_id  movie_id  rating  timestamp
0      196       242       3  881250949
1      186       302       3  891717742
2       22       377       1  878887116
3      244        51       2  880606923
4      166       346       1  886397596

In [10]:
ratings.shape

(100000, 4)

In [11]:
ratings.movie_id.nunique() # Number of unique

1682

In [12]:
ratings.loc[ratings.movie_id == 1, :].head()

      user_id  movie_id  rating  timestamp
24        308         1       4  887736532
454       287         1       5  875334088
957       148         1       4  877019411
971       280         1       4  891700426
1324       66         1       3  883601324

### Merging Movies and Ratings

In [13]:
movies.columns

Index(['movie_id', 'title'], dtype='object')

In [14]:
ratings.columns

Index(['user_id', 'movie_id', 'rating', 'timestamp'], dtype='object')

In [15]:
movie_ratings = pd.merge(movies, ratings)
movie_ratings.columns # By default, Matching columns with the same name

Index(['movie_id', 'title', 'user_id', 'rating', 'timestamp'], dtype='object')

In [16]:
movie_ratings.head()

   movie_id             title  user_id  rating  timestamp
0         1  Toy Story (1995)      308       4  887736532
1         1  Toy Story (1995)      287       5  875334088
2         1  Toy Story (1995)      148       4  877019411
3         1  Toy Story (1995)      280       4  891700426
4         1  Toy Story (1995)       66       3  883601324

In [17]:
movie_ratings.shape # 100000 rows because ratings has 100000 rows; ratings.shape (100000, 4)

(100000, 5)

In [18]:
print(movies.shape)
print(ratings.shape)
print(movie_ratings.shape)

(1682, 2)
(100000, 4)
(100000, 5)

#### What if the columns you want to join on don't have the same name?

In [19]:
movies.columns = ['m_id', 'title']
movies.columns

Index(['m_id', 'title'], dtype='object')

In [20]:
ratings.columns

Index(['user_id', 'movie_id', 'rating', 'timestamp'], dtype='object')

In [22]:
pd.merge(movies, ratings, left_on='m_id', right_on='movie_id').head()

   m_id             title  user_id  movie_id  rating  timestamp
0     1  Toy Story (1995)      308         1       4  887736532
1     1  Toy Story (1995)      287         1       5  875334088
2     1  Toy Story (1995)      148         1       4  877019411
3     1  Toy Story (1995)      280         1       4  891700426
4     1  Toy Story (1995)       66         1       3  883601324

### What if you want to join on one index?

In [23]:
movies = movies.set_index('m_id')
movies.head()

                  title
m_id
1      Toy Story (1995)
2      GoldenEye (1995)
3     Four Rooms (1995)
4     Get Shorty (1995)
5        Copycat (1995)

In [25]:
pd.merge(movies, ratings, left_index=True, right_on='movie_id')

,title,user_id,movie_id,rating,timestamp
24,Toy Story (1995),308,1,4,887736532
454,Toy Story (1995),287,1,5,875334088
957,Toy Story (1995),148,1,4,877019411
971,Toy Story (1995),280,1,4,891700426
1324,Toy Story (1995),66,1,3,883601324
...,...,...,...,...,...
75323,Mat' i syn (1997),863,1678,1,889289570
67302,B. Monkey (1998),863,1679,3,889289491
80394,Sliding Doors (1998),863,1680,2,889289570
92329,You So Crazy (1994),896,1681,3,887160722
95376,Scream of Stone (Schrei aus Stein) (1991),916,1682,3,880845755

### Two Indexes

In [26]:
ratings = ratings.set_index('movie_id')
ratings.head()

          user_id  rating  timestamp
movie_id
242           196       3  881250949
302           186       3  891717742
377            22       1  878887116
51            244       2  880606923
346           166       1  886397596

In [27]:
pd.merge(movies, ratings, left_index=True, right_index=True).head()

              title  user_id  rating  timestamp
1  Toy Story (1995)      308       4  887736532
1  Toy Story (1995)      287       5  875334088
1  Toy Story (1995)      148       4  877019411
1  Toy Story (1995)      280       4  891700426
1  Toy Story (1995)       66       3  883601324

### Four Types of Joins

In [28]:
A = pd.DataFrame({'color' : ['green','yellow','red'], 'num' : [1,2,3]})
A

    color  num
0   green    1
1  yellow    2
2     red    3

In [29]:
B = pd.DataFrame({'color' : ['green','yellow','pink'], 'size' :['S','M','L']})
B

    color size
0   green    S
1  yellow    M
2    pink    L

#### Inner Join

In [30]:
pd.merge(A, B, how='inner')

    color  num size
0   green    1    S
1  yellow    2    M


#### Outer Join

In [31]:
pd.merge(A,B,how='outer')

    color  num size
0   green  1.0    S
1  yellow  2.0    M
2     red  3.0  NaN
3    pink  NaN    L

#### Left Join

In [32]:
pd.merge(A,B,how='left')

    color  num size
0   green    1    S
1  yellow    2    M
2     red    3  NaN

#### Right Join

In [33]:
pd.merge(A,B,how='right')

    color  num size
0   green  1.0    S
1  yellow  2.0    M
2    pink  NaN    L